socialNetwork/results/scaling-off-sweep-bench1.5-may19/benchmark1.5b-noscale-sweep-05-19-26_023530/st5-AttUpd/400.txt
Running 2m test @ http://155.98.37.84:80
  16 threads and 128 connections

  Thread calibration: mean lat.: 289.918ms, rate sampling interval: 1059ms
  Thread calibration: mean lat.: 295.493ms, rate sampling interval: 1164ms
  Thread calibration: mean lat.: 330.798ms, rate sampling interval: 1421ms
  Thread calibration: mean lat.: 379.110ms, rate sampling interval: 1702ms
  Thread calibration: mean lat.: 479.405ms, rate sampling interval: 2344ms
  Thread calibration: mean lat.: 353.164ms, rate sampling interval: 1448ms
  Thread calibration: mean lat.: 346.036ms, rate sampling interval: 1534ms
  Thread calibration: mean lat.: 257.591ms, rate sampling interval: 948ms
  Thread calibration: mean lat.: 392.267ms, rate sampling interval: 1777ms
  Thread calibration: mean lat.: 449.006ms, rate sampling interval: 2271ms
  Thread calibration: mean lat.: 289.204ms, rate sampling interval: 1173ms
  Thread calibration: mean lat.: 331.948ms, rate sampling interval: 1383ms
  Thread calibration: mean lat.: 388.189ms, rate sampling interval: 1696ms
  Thread calibration: mean lat.: 341.357ms, rate sampling interval: 1475ms
  Thread calibration: mean lat.: 364.425ms, rate sampling interval: 1464ms
  Thread calibration: mean lat.: 340.430ms, rate sampling interval: 1417ms

-----------------------------------------------------------------------
Test Results @ http://155.98.37.84:80 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   807.49ms  823.99ms   3.74s    85.82%
    Req/Sec    24.20      4.07    35.00     78.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  504.06ms
 75.000%    1.08s 
 90.000%    1.96s 
 99.000%    3.74s 
 99.900%    5.17s 
 99.990%    6.33s 
 99.999%    6.78s 
100.000%    6.78s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      25.263     0.000000            1         1.00
     129.023     0.100000         4346         1.11
     206.591     0.200000         8690         1.25
     278.015     0.300000        13044         1.43
     372.735     0.400000        17378         1.67
     504.063     0.500000        21731         2.00
     583.167     0.550000        23899         2.22
     676.351     0.600000        26070         2.50
     785.919     0.650000        28242         2.86
     918.015     0.700000        30413         3.33
    1082.367     0.750000        32589         4.00
    1183.743     0.775000        33676         4.44
    1296.383     0.800000        34761         5.00
    1427.455     0.825000        35841         5.71
    1580.031     0.850000        36926         6.67
    1758.207     0.875000        38013         8.00
    1856.511     0.887500        38555         8.89
    1960.959     0.900000        39103        10.00
    2073.599     0.912500        39643        11.43
    2213.887     0.925000        40190        13.33
    2369.535     0.937500        40728        16.00
    2467.839     0.943750        41001        17.78
    2566.143     0.950000        41270        20.00
    2684.927     0.956250        41543        22.86
    2807.807     0.962500        41813        26.67
    2959.359     0.968750        42088        32.00
    3037.183     0.971875        42223        35.56
    3125.247     0.975000        42356        40.00
    3227.647     0.978125        42493        45.71
    3334.143     0.981250        42630        53.33
    3450.879     0.984375        42764        64.00
    3528.703     0.985938        42833        71.11
    3594.239     0.987500        42900        80.00
    3682.303     0.989062        42967        91.43
    3780.607     0.990625        43035       106.67
    3887.103     0.992188        43103       128.00
    3950.591     0.992969        43138       142.22
    4012.031     0.993750        43171       160.00
    4079.615     0.994531        43205       182.86
    4192.255     0.995313        43240       213.33
    4333.567     0.996094        43273       256.00
    4399.103     0.996484        43291       284.44
    4497.407     0.996875        43307       320.00
    4599.807     0.997266        43324       365.71
    4665.343     0.997656        43341       426.67
    4771.839     0.998047        43358       512.00
    4820.991     0.998242        43366       568.89
    4943.871     0.998437        43375       640.00
    5009.407     0.998633        43383       731.43
    5091.327     0.998828        43393       853.33
    5189.631     0.999023        43400      1024.00
    5357.567     0.999121        43404      1137.78
    5451.775     0.999219        43409      1280.00
    5492.735     0.999316        43413      1462.86
    5599.231     0.999414        43417      1706.67
    5664.767     0.999512        43421      2048.00
    5701.631     0.999561        43423      2275.56
    5763.071     0.999609        43426      2560.00
    5771.263     0.999658        43428      2925.71
    5877.759     0.999707        43430      3413.33
    5906.431     0.999756        43432      4096.00
    5963.775     0.999780        43433      4551.11
    6176.767     0.999805        43434      5120.00
    6201.343     0.999829        43436      5851.43
    6201.343     0.999854        43436      6826.67
    6291.455     0.999878        43437      8192.00
    6328.319     0.999890        43438      9102.22
    6328.319     0.999902        43438     10240.00
    6660.095     0.999915        43439     11702.86
    6660.095     0.999927        43439     13653.33
    6684.671     0.999939        43440     16384.00
    6684.671     0.999945        43440     18204.44
    6684.671     0.999951        43440     20480.00
    6778.879     0.999957        43442     23405.71
    6778.879     1.000000        43442          inf
#[Mean    =      807.494, StdDeviation   =      823.989]
#[Max     =     6774.784, Total count    =        43442]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  47157 requests in 2.00m, 580.48MB read
  Socket errors: connect 0, read 0, write 0, timeout 19
Requests/sec:    392.93  
Transfer/sec:      4.84MB